In [1]:
import os
import openpyxl
import pandas as pd

In [2]:
fname = r'F:\repos\fish\Chapter-12-4-1.xlsx'
df = pd.read_excel(fname)
df

   姓名  科目   分数
0  小张  语文   96
1  小张  数学  100
2  小张  英语   97
3  李飞  语文   95
4  李飞  英语   98
5  小曾  语文   96
6  小江  语文   98
7  小江  数学   99
8  小江  英语  100

In [28]:
df1 = df.copy()
df1.set_index(['姓名','科目'],inplace = True)
df1 = df1.unstack()
df2 = df1.copy()
df2

       分数
科目     数学     英语    语文
姓名
小张  100.0   97.0  96.0
小曾    NaN    NaN  96.0
小江   99.0  100.0  98.0
李飞    NaN   98.0  95.0

In [31]:
df2.index

Index(['小张', '小曾', '小江', '李飞'], dtype='object', name='姓名')

In [35]:
df2.columns = df2.columns.get_level_values(1)
df2

科目     数学     英语    语文
姓名
小张  100.0   97.0  96.0
小曾    NaN    NaN  96.0
小江   99.0  100.0  98.0
李飞    NaN   98.0  95.0

In [41]:
df3 = df2.copy()
df3 = df3.reset_index()
df3

科目  姓名     数学     英语    语文
0   小张  100.0   97.0  96.0
1   小曾    NaN    NaN  96.0
2   小江   99.0  100.0  98.0
3   李飞    NaN   98.0  95.0

In [42]:
df3.fillna('',inplace = True)

In [49]:
df3 = df3.loc[:,['姓名', '语文', '数学', '英语']]
df3

科目  姓名    语文     数学     英语
0   小张  96.0  100.0   97.0
1   小曾  96.0
2   小江  98.0   99.0  100.0
3   李飞  95.0          98.0

In [46]:
df3 = df3[['姓名','语文'，'数学','英语']]
df3

SyntaxError: invalid character in identifier (1086936336.py, line 1)

In [ ]:
df3.loc[['姓名','语文'，'数学','英语']